Revit 2027 API
BuiltInFailures.WorksharingFailures.DuplicateNamesChanged Property
 These elements' names were automatically changed to eliminate duplicates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateNamesChanged { get; }
Public Shared ReadOnly Property DuplicateNamesChanged As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateNamesChanged {
	FailureDefinitionId^ get ();
}
static member DuplicateNamesChanged : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WorksharingFailures Class
Autodesk.Revit.DB Namespace